module.exports = async (req, res) => {
    res.status(200).json({
        "lesson_id": "1",
        "lesson_name": "AUTHOR’S PURPOSE",
        "lesson_category": "reading",
        "lesson_level": "A1",

        "created_at": "2025-12-16T06:00:00Z",
        "updated_at": "2025-12-16T06:00:00Z",
        "created_by": "Pakawat Boonchoodoung",

        "lesson_content": {
            "p1": "Author’s purpose ก็คือ จุดประสงค์ของผู้เขียนงานที่เราอ่านอยู่ ซึ่งงานเขียนแต่ละชิ้นนั้น ผู้เขียนก็ย่อมมีจุดประสงค์ในการเขียนแตกต่างกัน",

            "p2": "แม้การอ่านปกติเราอาจจะไม่จำเป็นต้องเข้าใจถึงเรื่อง Author’s purpose แต่ในการอ่านเพื่อสอบวัดระดับภาษาอังกฤษ หรือในการเรียนรู้ภาษานั้นเราก็ควรจะต้องเข้าใจในเรื่องนี้ เนื่องจากว่าการสอบเรื่องการอ่านในระดับสูงนั้น มักจะมี Author’s purpose เข้ามาเกี่ยวข้องในรูปของคำถามเสมอ",

            "p3": "Author’s purpose ถ้าหากจะจำแนกให้เข้าใจได้อย่างง่ายที่สุด เราคงจำแนกออกได้เป็น Author’s purpose ประเภททั่ว ๆ ไปได้ 3 ประเภท ได้แก่",

            "p4": "1. Entertain Entertain หรือ การเขียนเพื่อให้ความบันเทิง เช่น งานเขียนจำพวกเรื่องสั้น เรื่องตลก นิยาย หรือเรื่องเกล็ดเล็กเกล็ดน้อย เป็นต้น",

            "p5": "2. Inform Inform หรือ การให้ข้อมูล เป็นการเขียนให้ข้อมูลแก่ผู้อ่าน การเขียนในลักษณะนี้ก็ได้แก่ งานเขียนจำพวกหนังสือเรียน หรือตำราต่าง ๆ คู่มือต่าง ๆ เช่น คู่มือท่องเที่ยว ฉลากสินค้า เป็นต้น",

            "p6": "3. Persuade Persuade หรือการเขียนเพื่อชักจูงให้ผู้อ่านคล้อยตาม เช่น งานเขียนโฆษณาสินค้า คำขวัญ หรือ งานเขียนบทวิจารณ์ต่าง ๆ เป็นต้น",

            "p7": "Specific purposes นอกจากจุดประสงค์ของผู้เขียนประเภททั่ว ๆ ไป 3 ข้อข้างต้นแล้ว ก็ยังมี Author’s purpose ประเภทที่เจาะจงมากขึ้นอีก เช่น การเขียนเพื่อวิจารณ์ (Criticize) การเขียนเพื่อทำนาย (Predict) การเขียนวิเคราะห์ (Analyze) การเขียนอธิบาย (Explain) การเขียนเพื่อเปรียบเทียบ (Compare) การเขียนรายงาน (Report) การโฆษณา (Advertise) การโต้แย้ง (Disagree / Argue) และการเขียนเพื่อแนะนำ (Suggest / Recommend)",

            "p8": "แล้วเราจะสามารถรู้ได้อย่างไรว่า Author’s purpose นั้นคืออะไร บางครั้งในงานเขียนอาจมีคำบอกจุดประสงค์โดยตรง เช่น purpose goal aim หรือ reason แต่โดยส่วนมากผู้อ่านจำเป็นต้องวิเคราะห์จากเนื้อหาของงานเขียนนั้นด้วยตนเอง",

            "p9": "ตัวอย่าง Buy It Because It’s the Better Car จากโฆษณารถ Ford Model T ข้อความนี้เป็นข้อความโฆษณา ดังนั้น Author’s purpose คือ Persuade",

            "p10": "20 free things to do in Sydney เป็นบทความแนะนำสถานที่ท่องเที่ยว ดังนั้น Author’s purpose สามารถเป็นได้ทั้ง Entertain และ Suggest",

            "p11": "ในบางครั้ง Author’s purpose สามารถมีได้มากกว่าหนึ่งอย่าง และในข้อสอบแบบ multiple choice ต้องระวังถ้อยคำให้ตรงที่สุด เช่น tourist attractions กับ free tourist attractions",

            "p12": "สุดท้าย บทเรียนนี้เองก็เป็นตัวอย่างของ Author’s purpose ซึ่ง Author’s purpose ของบทเรียนนี้คือ Inform และ Explain"
        }
    })
}
